//Default Config cho trang chủ
export const homeConfig = {
  // Các đường link
  navLinks: [
    {
      title: "Trang chủ",
      path: "/home",
    },
    {
      title: "Dịch vụ",
      path: "/services",
    },
    {
      title: "Liên hệ",
      path: "/contact",
    },
  ],
  //Nội dung footer
  footer: {
    address: " 20C/75/213 Thiên Lôi",
    wokingTime: " 8h-17h30",
    phone: " (+84) 788 300 894",
    email: " ktscropvn@gmail.com",
  },
};

//Default Config cho trang quản trị
export const dashboardConfig = {
  //Các đường link cho người dùng
  userLinks: [
    {
      title: "Tổng quan",
      path: "/dashboard",
      d: "M3 6a3 3 0 013-3h12a3 3 0 013 3v12a3 3 0 01-3 3H6a3 3 0 01-3-3V6zm4.5 7.5a.75.75 0 01.75.75v2.25a.75.75 0 01-1.5 0v-2.25a.75.75 0 01.75-.75zm3.75-1.5a.75.75 0 00-1.5 0v4.5a.75.75 0 001.5 0V12zm2.25-3a.75.75 0 01.75.75v6.75a.75.75 0 01-1.5 0V9.75A.75.75 0 0113.5 9zm3.75-1.5a.75.75 0 00-1.5 0v9a.75.75 0 001.5 0v-9z",
      dis: "translate-x-0",
      role: import.meta.env.VITE_KTS_LV3,
    },
    {
      title: "Đơn hàng",
      path: "/dashboard/bills",
      d: "M12 7.5h1.5m-1.5 3h1.5m-7.5 3h7.5m-7.5 3h7.5m3-9h3.375c.621 0 1.125.504 1.125 1.125V18a2.25 2.25 0 01-2.25 2.25M16.5 7.5V18a2.25 2.25 0 002.25 2.25M16.5 7.5V4.875c0-.621-.504-1.125-1.125-1.125H4.125C3.504 3.75 3 4.254 3 4.875V18a2.25 2.25 0 002.25 2.25h13.5M6 7.5h3v3H6v-3z",
      dis: "translate-x-16",
      role: import.meta.env.VITE_KTS_LV3,
    },
    {
      title: "Tracking",
      path: "/dashboard/tracking",
      d: "M15 10.5a3 3 0 11-6 0 3 3 0 016 0z M19.5 10.5c0 7.142-7.5 11.25-7.5 11.25S4.5 17.642 4.5 10.5a7.5 7.5 0 1115 0z",
      dis: "translate-x-64",
      role: import.meta.env.VITE_KTS_LV3,
    },
    {
      title: "Khách hàng",
      path: "/dashboard/customers",
      d: "M15.75 6a3.75 3.75 0 11-7.5 0 3.75 3.75 0 017.5 0zM4.501 20.118a7.5 7.5 0 0114.998 0A17.933 17.933 0 0112 21.75c-2.676 0-5.216-.584-7.499-1.632z",
      dis: "translate-x-64",
      role: import.meta.env.VITE_KTS_LV3,
    },
    {
      title: "Cost",
      path: "/dashboard/cost",
      d: "M12 6v12m-3-2.818l.879.659c1.171.879 3.07.879 4.242 0 1.172-.879 1.172-2.303 0-3.182C13.536 12.219 12.768 12 12 12c-.725 0-1.45-.22-2.003-.659-1.106-.879-1.106-2.303 0-3.182s2.9-.879 4.006 0l.415.33M21 12a9 9 0 11-18 0 9 9 0 0118 0z",
      role: import.meta.env.VITE_KTS_LV2,
    },
    {
      title: "Đối tác",
      path: "/dashboard/partners",
      d: "M19 7.5v3m0 0v3m0-3h3m-3 0h-3m-2.25-4.125a3.375 3.375 0 11-6.75 0 3.375 3.375 0 016.75 0zM4 19.235v-.11a6.375 6.375 0 0112.75 0v.109A12.318 12.318 0 0110.374 21c-2.331 0-4.512-.645-6.374-1.766z",
      role: import.meta.env.VITE_KTS_LV2,
    },
    {
      title: "Tài khoản",
      path: "/dashboard/setting",
      d: "M15 12a3 3 0 11-6 0 3 3 0 016 0z M10.343 3.94c.09-.542.56-.94 1.11-.94h1.093c.55 0 1.02.398 1.11.94l.149.894c.07.424.384.764.78.93.398.164.855.142 1.205-.108l.737-.527a1.125 1.125 0 011.45.12l.773.774c.39.389.44 1.002.12 1.45l-.527.737c-.25.35-.272.806-.107 1.204.165.397.505.71.93.78l.893.15c.543.09.94.56.94 1.109v1.094c0 .55-.397 1.02-.94 1.11l-.893.149c-.425.07-.765.383-.93.78-.165.398-.143.854.107 1.204l.527.738c.32.447.269 1.06-.12 1.45l-.774.773a1.125 1.125 0 01-1.449.12l-.738-.527c-.35-.25-.806-.272-1.203-.107-.397.165-.71.505-.781.929l-.149.894c-.09.542-.56.94-1.11.94h-1.094c-.55 0-1.019-.398-1.11-.94l-.148-.894c-.071-.424-.384-.764-.781-.93-.398-.164-.854-.142-1.204.108l-.738.527c-.447.32-1.06.269-1.45-.12l-.773-.774a1.125 1.125 0 01-.12-1.45l.527-.737c.25-.35.273-.806.108-1.204-.165-.397-.505-.71-.93-.78l-.894-.15c-.542-.09-.94-.56-.94-1.109v-1.094c0-.55.398-1.02.94-1.11l.894-.149c.424-.07.765-.383.93-.78.165-.398.143-.854-.107-1.204l-.527-.738a1.125 1.125 0 01.12-1.45l.773-.773a1.125 1.125 0 011.45-.12l.737.527c.35.25.807.272 1.204.107.397-.165.71-.505.78-.929l.15-.894z",
      dis: "translate-x-48",
      role: import.meta.env.VITE_KTS_LV3,
    },
    {
      title: "Viettel",
      path: "/dashboard/viettel",
      d: "M20.25 6.375c0 2.278-3.694 4.125-8.25 4.125S3.75 8.653 3.75 6.375m16.5 0c0-2.278-3.694-4.125-8.25-4.125S3.75 4.097 3.75 6.375m16.5 0v11.25c0 2.278-3.694 4.125-8.25 4.125s-8.25-1.847-8.25-4.125V6.375m16.5 0v3.75m-16.5-3.75v3.75m16.5 0v3.75C20.25 16.153 16.556 18 12 18s-8.25-1.847-8.25-4.125v-3.75m16.5 0c0 2.278-3.694 4.125-8.25 4.125s-8.25-1.847-8.25-4.125",
      role: import.meta.env.VITE_KTS_LV0,
    },
  ],
  //Các đường link cho Admin
  adminLinks: [
    {
      title: "Users",
      path: "/dashboard/accounts",
      d: "M18 18.72a9.094 9.094 0 003.741-.479 3 3 0 00-4.682-2.72m.94 3.198l.001.031c0 .225-.012.447-.037.666A11.944 11.944 0 0112 21c-2.17 0-4.207-.576-5.963-1.584A6.062 6.062 0 016 18.719m12 0a5.971 5.971 0 00-.941-3.197m0 0A5.995 5.995 0 0012 12.75a5.995 5.995 0 00-5.058 2.772m0 0a3 3 0 00-4.681 2.72 8.986 8.986 0 003.74.477m.94-3.197a5.971 5.971 0 00-.94 3.197M15 6.75a3 3 0 11-6 0 3 3 0 016 0zm6 3a2.25 2.25 0 11-4.5 0 2.25 2.25 0 014.5 0zm-13.5 0a2.25 2.25 0 11-4.5 0 2.25 2.25 0 014.5 0z",
      gap: true,
      role: import.meta.env.VITE_KTS_LV0,
    },
    {
      title: "Cấu hình hệ thống",
      path: "/dashboard/config",
      d: "M4.5 12a7.5 7.5 0 0015 0m-15 0a7.5 7.5 0 1115 0m-15 0H3m16.5 0H21m-1.5 0H12m-8.457 3.077l1.41-.513m14.095-5.13l1.41-.513M5.106 17.785l1.15-.964m11.49-9.642l1.149-.964M7.501 19.795l.75-1.3m7.5-12.99l.75-1.3m-6.063 16.658l.26-1.477m2.605-14.772l.26-1.477m0 17.726l-.26-1.477M10.698 4.614l-.26-1.477M16.5 19.794l-.75-1.299M7.5 4.205L12 12m6.894 5.785l-1.149-.964M6.256 7.178l-1.15-.964m15.352 8.864l-1.41-.513M4.954 9.435l-1.41-.514M12.002 12l-3.75 6.495",
      role: import.meta.env.VITE_KTS_LV0,
    },
  ],
};

export const footerConfig = {
  adminLinks: [
    {
      title: "Quản lý tài khoản",
      path: "/dashboard/accounts",
      d: "M18 18.72a9.094 9.094 0 003.741-.479 3 3 0 00-4.682-2.72m.94 3.198l.001.031c0 .225-.012.447-.037.666A11.944 11.944 0 0112 21c-2.17 0-4.207-.576-5.963-1.584A6.062 6.062 0 016 18.719m12 0a5.971 5.971 0 00-.941-3.197m0 0A5.995 5.995 0 0012 12.75a5.995 5.995 0 00-5.058 2.772m0 0a3 3 0 00-4.681 2.72 8.986 8.986 0 003.74.477m.94-3.197a5.971 5.971 0 00-.94 3.197M15 6.75a3 3 0 11-6 0 3 3 0 016 0zm6 3a2.25 2.25 0 11-4.5 0 2.25 2.25 0 014.5 0zm-13.5 0a2.25 2.25 0 11-4.5 0 2.25 2.25 0 014.5 0z",
      gap: true,
    },
    {
      title: "Phí giao hàng",
      path: "/dashboard/cost",
      d: "M12 6v12m-3-2.818l.879.659c1.171.879 3.07.879 4.242 0 1.172-.879 1.172-2.303 0-3.182C13.536 12.219 12.768 12 12 12c-.725 0-1.45-.22-2.003-.659-1.106-.879-1.106-2.303 0-3.182s2.9-.879 4.006 0l.415.33M21 12a9 9 0 11-18 0 9 9 0 0118 0z",
    },
    {
      title: "Cài đặt trang chủ",
      path: "/dashboard/config",
      d: "M4.5 12a7.5 7.5 0 0015 0m-15 0a7.5 7.5 0 1115 0m-15 0H3m16.5 0H21m-1.5 0H12m-8.457 3.077l1.41-.513m14.095-5.13l1.41-.513M5.106 17.785l1.15-.964m11.49-9.642l1.149-.964M7.501 19.795l.75-1.3m7.5-12.99l.75-1.3m-6.063 16.658l.26-1.477m2.605-14.772l.26-1.477m0 17.726l-.26-1.477M10.698 4.614l-.26-1.477M16.5 19.794l-.75-1.299M7.5 4.205L12 12m6.894 5.785l-1.149-.964M6.256 7.178l-1.15-.964m15.352 8.864l-1.41-.513M4.954 9.435l-1.41-.514M12.002 12l-3.75 6.495",
    },
    {
      title: "Quản lý Databases",
      path: "/dashboard/databases",
      d: "M20.25 6.375c0 2.278-3.694 4.125-8.25 4.125S3.75 8.653 3.75 6.375m16.5 0c0-2.278-3.694-4.125-8.25-4.125S3.75 4.097 3.75 6.375m16.5 0v11.25c0 2.278-3.694 4.125-8.25 4.125s-8.25-1.847-8.25-4.125V6.375m16.5 0v3.75m-16.5-3.75v3.75m16.5 0v3.75C20.25 16.153 16.556 18 12 18s-8.25-1.847-8.25-4.125v-3.75m16.5 0c0 2.278-3.694 4.125-8.25 4.125s-8.25-1.847-8.25-4.125",
    },
  ],
};
export const STATUS = [
  {
    id: 0,
    bgColor: "border bg-white border-cyan-500",
    name: "Đơn mới",
    textColor: "text-cyan-500",
    bdColor: "border-cyan-500",
    hover: "hover:bg-cyan-500",
  },
  {
    id: 1,
    bgColor: "bg-blue-300",
    name: "Đang giao",
    textColor: "text-blue-600",
    bdColor: "border-blue-500",
    hover: "hover:bg-blue-500",
  },
  {
    id: 2,
    bgColor: "bg-orange-300",
    name: "Chuyển hoàn",
    textColor: "text-orange-600",
    bdColor: "border-orange-500",
    hover: "hover:bg-orange-500",
  },
  {
    id: 3,
    bgColor: "bg-green-300",
    name: "Giao xong",
    textColor: "text-green-600",
    bdColor: "border-green-500",
    hover: "hover:bg-green-500",
  },
  {
    id: 4,
    bgColor: "bg-red-300",
    name: "Đơn hủy",
    textColor: "text-red-600",
    bdColor: "border-red-500",
    hover: "hover:bg-red-500",
  },
];
export const ktsTitle = {
  0: { vn: "Mã vận đơn", cn: "快遞單號" },
  1: { vn: "Trạng thái cuối cùng", cn: "快遞狀態" },
  2: { vn: "Chi tiết bưu gửi", cn: "查看物流" },
};

export const ktsChangeLogs = [
  { v: "3.1.0", detail: ["Bắt đầu sử dụng engine UI mới"], date: "11-3-2023" },
  {
    v: "3.1.1",
    detail: [
      "Mở khoá NCC Viettel Post",
      "Thêm mới tính năng tạo đơn lẻ (VTP)",
      "Thêm mới tính năng tạo đơn theo lô bằng Excel (VTP)",
    ],
    date: "11-11-2023",
  },
  {
    v: "3.1.2",
    detail: ["Tối ưu tính năng Đơn Hàng", "Thêm tùy chọn tìm kiếm nâng cao"],
    date: "07-01-2024",
  },
];
